#+EXPORT_FILE_NAME: ../reports/benchmark_evaluación
#+LATEX_HEADER: \usepackage{parskip}
#+PROPERTY: header-args :session python :results silent :dir ..
#+OPTIONS: ^:nil toc:nil num:nil
** Resultados por grupo

Se calcula la desviación estándar de los errores, junto con la
métrica RMSE para cada uno de los métodos/modelos, considerando los distintos
grupos de preguntas:

#+begin_src python :exports results :results value table replace
import re
groups = ['context', 'language', 'similarity']
metrics = [m for m in metrics if not re.match('^.*(vicuna|falcon)', m)]
df_groups = pd.DataFrame()
for metric in metrics:
    for group in groups:
        df_rmse = df.groupby(group)[metric + '_error'].apply(
            lambda x: np.sqrt(np.mean(x ** 2)).round(3)).reset_index().rename(
                columns={metric + '_error': 'rmse'})
        df_std = df.groupby(group)[metric + '_error'].apply(
            lambda x: np.std(x).round(3)).reset_index().rename(
                columns={metric + '_error': 'std'})
        df_group = df_rmse.merge(df_std, on=group)
        df_group = df_group.rename(columns={group: 'value'})
        df_group['group'] = group
        df_group['metric'] = metric
        df_groups = pd.concat([df_groups, df_group])
df_groups = df_groups[['metric', 'group', 'value', 'rmse', 'std']]
df_groups = df_groups.sort_values(['group', 'value', 'rmse'])
[list(df_groups)] + [None] + df_groups.values.tolist()
#+end_src

#+RESULTS:
| metric                                    | group      |   value |  rmse |   std |
|-------------------------------------------+------------+---------+-------+-------|
| LLM_Mistral-7B-Instruct-v0.1              | context    |   False | 0.178 | 0.177 |
| SAS_paraphrase-multilingual-MiniLM-L12-v2 | context    |   False | 0.193 | 0.187 |
| SAS_multi-qa-MiniLM-L6-cos-v1             | context    |   False | 0.285 | 0.258 |
| SAS_all-MiniLM-L12-v2                     | context    |   False |  0.29 | 0.256 |
| SAS_paraphrase-multilingual-MiniLM-L12-v2 | context    |    True | 0.176 | 0.176 |
| SAS_all-MiniLM-L12-v2                     | context    |    True | 0.191 | 0.191 |
| SAS_multi-qa-MiniLM-L6-cos-v1             | context    |    True | 0.218 | 0.217 |
| LLM_Mistral-7B-Instruct-v0.1              | context    |    True | 0.248 | 0.241 |
| SAS_paraphrase-multilingual-MiniLM-L12-v2 | language   | Español | 0.208 | 0.208 |
| LLM_Mistral-7B-Instruct-v0.1              | language   | Español | 0.271 | 0.266 |
| SAS_all-MiniLM-L12-v2                     | language   | Español | 0.277 | 0.259 |
| SAS_multi-qa-MiniLM-L6-cos-v1             | language   | Español | 0.298 | 0.275 |
| SAS_all-MiniLM-L12-v2                     | language   |  Inglés | 0.149 | 0.149 |
| SAS_paraphrase-multilingual-MiniLM-L12-v2 | language   |  Inglés |  0.15 |  0.15 |
| SAS_multi-qa-MiniLM-L6-cos-v1             | language   |  Inglés | 0.156 | 0.155 |
| LLM_Mistral-7B-Instruct-v0.1              | language   |  Inglés | 0.182 | 0.178 |
| SAS_paraphrase-multilingual-MiniLM-L12-v2 | similarity |     0.0 | 0.096 | 0.071 |
| LLM_Mistral-7B-Instruct-v0.1              | similarity |     0.0 | 0.101 | 0.093 |
| SAS_all-MiniLM-L12-v2                     | similarity |     0.0 | 0.254 | 0.163 |
| SAS_multi-qa-MiniLM-L6-cos-v1             | similarity |     0.0 | 0.277 | 0.181 |
| SAS_paraphrase-multilingual-MiniLM-L12-v2 | similarity |    0.25 | 0.185 | 0.144 |
| SAS_all-MiniLM-L12-v2                     | similarity |    0.25 | 0.187 | 0.133 |
| SAS_multi-qa-MiniLM-L6-cos-v1             | similarity |    0.25 | 0.209 | 0.138 |
| LLM_Mistral-7B-Instruct-v0.1              | similarity |    0.25 |  0.26 |  0.26 |
| SAS_all-MiniLM-L12-v2                     | similarity |     0.5 | 0.252 |  0.21 |
| SAS_paraphrase-multilingual-MiniLM-L12-v2 | similarity |     0.5 | 0.269 | 0.234 |
| SAS_multi-qa-MiniLM-L6-cos-v1             | similarity |     0.5 |  0.27 |  0.22 |
| LLM_Mistral-7B-Instruct-v0.1              | similarity |     0.5 | 0.398 | 0.369 |
| SAS_all-MiniLM-L12-v2                     | similarity |    0.75 | 0.217 | 0.202 |
| SAS_paraphrase-multilingual-MiniLM-L12-v2 | similarity |    0.75 | 0.221 | 0.213 |
| SAS_multi-qa-MiniLM-L6-cos-v1             | similarity |    0.75 | 0.229 | 0.213 |
| LLM_Mistral-7B-Instruct-v0.1              | similarity |    0.75 |  0.26 | 0.238 |
| LLM_Mistral-7B-Instruct-v0.1              | similarity |     1.0 | 0.173 | 0.171 |
| SAS_all-MiniLM-L12-v2                     | similarity |     1.0 | 0.173 | 0.171 |
| SAS_paraphrase-multilingual-MiniLM-L12-v2 | similarity |     1.0 | 0.173 | 0.171 |
| SAS_multi-qa-MiniLM-L6-cos-v1             | similarity |     1.0 | 0.174 | 0.171 |

De este análisis de las métricas agrupadas se puede obtener lo siguiente:

- Parece ser que para cualquier método (SAS o basado en LLM ), la evaluación es
  más precisa cuando el idioma es el inglés. Esto es lógico, dado que
  probablemente la mayoría de contenido con el que han sido entrenados los LLM
  es el inglés.
- Como es lógico, independientemente del método y del modelo, los casos
  extremos son más fáciles de evaluar, mientras que los intermedios conllevan
  más error.
- El rendimiento es parecido si se comparan preguntas dentro del contexto
  contra preguntas fuera de contexto

** Resultados globales

Se calcula la desviación estándar de los errores, junto con la
métrica RMSE para cada uno de los métodos/modelos:

#+begin_src python :exports results :results value table replace
results = []
for metric in metrics:
    rmse = np.sqrt(np.mean(df[metric + '_error'] ** 2)).round(3)
    std = np.std(df[metric + '_error']).round(3)
    metric_result = {'metric': metric, 'rmse': rmse, 'std': std}
    results.append(metric_result)
df_results = pd.DataFrame(results).sort_values('rmse')
[list(df_results)] + [None] + df_results.values.tolist()
#+end_src

#+RESULTS:
| metric                                    |  rmse |   std |
|-------------------------------------------+-------+-------|
| SAS_paraphrase-multilingual-MiniLM-L12-v2 | 0.181 | 0.181 |
| SAS_all-MiniLM-L12-v2                     | 0.222 | 0.218 |
| LLM_Mistral-7B-Instruct-v0.1              | 0.231 | 0.227 |
| SAS_multi-qa-MiniLM-L6-cos-v1             | 0.238 | 0.233 |
| LLM_falcon-7b-instruct                    | 0.462 | 0.461 |
| LLM_vicuna-7b-v1.5                        | 0.465 | 0.441 |

Teniendo en cuenta que los valores de similitud oscilan entre 0 y 1, un RMSE <
0.2 se puede considerar un valor aceptable para el problema en
cuestión. Teniendo en cuenta que las evaluaciones del chatbot definitivas se
harán con 100 preguntas, hará que la métrica de evaluación de éstos se acerque
a su calidad real[fn:2].

